IDEA StatiCa Open Model
CoordSystemByPoint Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Coordinates system defid by the point and the plane
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Geometry3D.CoordSystem
 IdeaRS.OpenModel.Geometry3D.CoordSystemByPoint
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class CoordSystemByPoint : CoordSystem
Public Class CoordSystemByPoint
	Inherits CoordSystem
public ref class CoordSystemByPoint : public CoordSystem
The CoordSystemByPoint type exposes the following members.
Constructors
Name | Description
CoordSystemByPoint
Initializes a new instance of the CoordSystemByPoint class
Top
Properties
Name | Description
InPlane
 Point is in Plane
Point
 Point where Y o Z axis is located
Top
See Also
Reference
IdeaRS.OpenModel.Geometry3D Namespace